---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDesiredNumberOfRisers
source: html/fc20a222-2bed-386e-062a-49748482079f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDesiredNumberOfRisers Property

"Desired Number of Risers": The number of risers is calculated based on stairs height

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDesiredNumberOfRisers { get; }
```